Ran Plan for dir: `terraform/bitwarden` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_instance_profile.bitwarden_role must be replaced
-/+ resource "aws_iam_instance_profile" "bitwarden_role" {
      ~ arn         = "arn:aws:iam::376585504040:instance-profile/bitwarden-instance-profile" -> (known after apply)
      ~ create_date = "2023-03-03T00:04:00Z" -> (known after apply)
      ~ id          = "bitwarden-instance-profile" -> (known after apply)
      ~ name        = "bitwarden-instance-profile" -> "bitwarden-instance-profile-a" # forces replacement
      - tags        = {} -> null
      ~ unique_id   = "AIPAVPLR6YUUGTJV6GDEI" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_spot_instance_request.bitwarden must be replaced
-/+ resource "aws_spot_instance_request" "bitwarden" {
      + arn                                  = (known after apply)
      + availability_zone                    = (known after apply)
      - block_duration_minutes               = 0 -> null
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + ebs_optimized                        = (known after apply)
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ iam_instance_profile                 = "bitwarden-instance-profile" -> "bitwarden-instance-profile-a" # forces replacement
      ~ id                                   = "sir-f9meka3p" -> (known after apply)
      + instance_state                       = (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-00b4578f660f1e58e" -> (known after apply)
      ~ private_dns                          = "ip-10-0-2-100.ap-northeast-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.2.100" -> (known after apply)
      ~ public_dns                           = "ec2-35-77-72-180.ap-northeast-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "35.77.72.180" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      ~ spot_bid_status                      = "fulfilled" -> (known after apply)
      ~ spot_instance_id                     = "i-02746e99d35e65ecc" -> (known after apply)
      ~ spot_price                           = "0.022050" -> "0.02205"
      ~ spot_request_state                   = "active" -> (known after apply)
        tags                                 = {
            "Name" = "bitwarden-zero-trust"
        }
      + tenancy                              = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ valid_from                           = "0001-01-01T00:00:00Z" -> (known after apply)
      ~ valid_until                          = "0001-01-01T00:00:00Z" -> (known after apply)
        # (16 unchanged attributes hidden)

      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdf" -> null
          - encrypted             = true -> null
          - iops                  = 3000 -> null
          - kms_key_id            = "arn:aws:kms:ap-northeast-1:376585504040:key/80b1e3bf-799b-4c21-b4c0-8cb649083bc3" -> null
          - tags                  = {
              - "Name"      = "bitwarden_data"
              - "Workspace" = "bitwarden"
            } -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0c607243a4c07d56e" -> null
          - volume_size           = 10 -> null
          - volume_type           = "gp3" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 3000 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 125 -> (known after apply)
          ~ volume_id             = "vol-0adfe3d9d0f4f000b" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
~ bitwarden_instance_id = "i-02746e99d35e65ecc" -> (known after apply)
Releasing state lock. This may take a few moments...
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/bitwarden`
* :put_litter_in_its_place: To **delete** this plan click [here](http://chrojunoMBP:4141/lock?id=chroju%252Finfrastructure%252Fterraform%252Fbitwarden%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/bitwarden`
</details>
Plan: 2 to add, 0 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`